## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_manifest.argocd-gateway will be created
+   resource "kubernetes_manifest" "argocd-gateway" {
+       manifest = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "Gateway"
+           metadata   = {
+               name      = "argocd"
+               namespace = "argocd"
            }
+           spec       = {
+               selector = {
+                   istio = "ingressgateway"
                }
+               servers  = [
+                   {
+                       hosts = [
+                           "argocd.wayofthesys.org",
                        ]
+                       port  = {
+                           name     = "http"
+                           number   = 80
+                           protocol = "HTTP"
                        }
+                       tls   = {
+                           httpsRedirect = false
                        }
                    },
+                   {
+                       hosts = [
+                           "argocd.wayofthesys.org",
                        ]
+                       port  = {
+                           name     = "https"
+                           number   = 443
+                           protocol = "HTTPS"
                        }
+                       tls   = {
+                           credentialName    = "wayofthesys-org-tls"
+                           mode              = "SIMPLE"
+                           privateKey        = "/etc/istio/ingressgateway-certs/tls.key"
+                           serverCertificate = "/etc/istio/ingressgateway-certs/tls.crt"
                        }
                    },
                ]
            }
        }
+       object   = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "Gateway"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "argocd"
+               namespace                  = "argocd"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               selector = {
+                   "istio" = "ingressgateway"
                }
+               servers  = [
+                   {
+                       bind            = (known after apply)
+                       defaultEndpoint = (known after apply)
+                       hosts           = [
+                           "argocd.wayofthesys.org",
                        ]
+                       name            = (known after apply)
+                       port            = {
+                           name       = "http"
+                           number     = 80
+                           protocol   = "HTTP"
+                           targetPort = (known after apply)
                        }
+                       tls             = {
+                           caCertificates        = (known after apply)
+                           cipherSuites          = (known after apply)
+                           credentialName        = (known after apply)
+                           httpsRedirect         = false
+                           maxProtocolVersion    = (known after apply)
+                           minProtocolVersion    = (known after apply)
+                           mode                  = (known after apply)
+                           privateKey            = (known after apply)
+                           serverCertificate     = (known after apply)
+                           subjectAltNames       = (known after apply)
+                           verifyCertificateHash = (known after apply)
+                           verifyCertificateSpki = (known after apply)
                        }
                    },
+                   {
+                       bind            = (known after apply)
+                       defaultEndpoint = (known after apply)
+                       hosts           = [
+                           "argocd.wayofthesys.org",
                        ]
+                       name            = (known after apply)
+                       port            = {
+                           name       = "https"
+                           number     = 443
+                           protocol   = "HTTPS"
+                           targetPort = (known after apply)
                        }
+                       tls             = {
+                           caCertificates        = (known after apply)
+                           cipherSuites          = (known after apply)
+                           credentialName        = "wayofthesys-org-tls"
+                           httpsRedirect         = (known after apply)
+                           maxProtocolVersion    = (known after apply)
+                           minProtocolVersion    = (known after apply)
+                           mode                  = "SIMPLE"
+                           privateKey            = "/etc/istio/ingressgateway-certs/tls.key"
+                           serverCertificate     = "/etc/istio/ingressgateway-certs/tls.crt"
+                           subjectAltNames       = (known after apply)
+                           verifyCertificateHash = (known after apply)
+                           verifyCertificateSpki = (known after apply)
                        }
                    },
                ]
            }
        }
    }

  # kubernetes_manifest.certificate_argo_argo must be replaced
-/+ resource "kubernetes_manifest" "certificate_argo_argo" {
!       manifest = {
!           metadata   = {
                name      = "argocd-cert"
!               namespace = "argocd" -> "istio-system" # forces replacement
            }
            # (3 unchanged elements hidden)
        }
!       object   = {
!           metadata   = {
!               annotations                = null -> (known after apply)
!               clusterName                = null -> (known after apply)
!               creationTimestamp          = null -> (known after apply)
!               deletionGracePeriodSeconds = null -> (known after apply)
!               deletionTimestamp          = null -> (known after apply)
!               finalizers                 = null -> (known after apply)
!               generateName               = null -> (known after apply)
!               generation                 = null -> (known after apply)
!               labels                     = null -> (known after apply)
!               managedFields              = null -> (known after apply)
                name                       = "argocd-cert"
!               namespace                  = "argocd" -> "istio-system"
!               ownerReferences            = null -> (known after apply)
!               resourceVersion            = null -> (known after apply)
!               selfLink                   = null -> (known after apply)
!               uid                        = null -> (known after apply)
            }
!           spec       = {
!               additionalOutputFormats = null -> (known after apply)
!               duration                = null -> (known after apply)
!               emailAddresses          = null -> (known after apply)
!               encodeUsagesInRequest   = null -> (known after apply)
!               ipAddresses             = null -> (known after apply)
!               isCA                    = null -> (known after apply)
!               issuerRef               = {
!                   group = null -> (known after apply)
                    name  = "zerossl"
                    # (1 unchanged element hidden)
                }
!               keystores               = {
!                   jks    = {
!                       create            = null -> (known after apply)
!                       passwordSecretRef = {
!                           key  = null -> (known after apply)
!                           name = null -> (known after apply)
                        }
                    }
!                   pkcs12 = {
!                       create            = null -> (known after apply)
!                       passwordSecretRef = {
!                           key  = null -> (known after apply)
!                           name = null -> (known after apply)
                        }
                    }
                }
!               literalSubject          = null -> (known after apply)
!               privateKey              = {
!                   algorithm      = null -> (known after apply)
!                   encoding       = null -> (known after apply)
!                   rotationPolicy = null -> (known after apply)
!                   size           = null -> (known after apply)
                }
!               renewBefore             = null -> (known after apply)
!               revisionHistoryLimit    = null -> (known after apply)
!               secretTemplate          = {
!                   annotations = null -> (known after apply)
!                   labels      = null -> (known after apply)
                }
!               subject                 = {
!                   countries           = null -> (known after apply)
!                   localities          = null -> (known after apply)
!                   organizationalUnits = null -> (known after apply)
!                   organizations       = null -> (known after apply)
!                   postalCodes         = null -> (known after apply)
!                   provinces           = null -> (known after apply)
!                   serialNumber        = null -> (known after apply)
!                   streetAddresses     = null -> (known after apply)
                }
!               uris                    = null -> (known after apply)
!               usages                  = null -> (known after apply)
                # (3 unchanged elements hidden)
            }
            # (2 unchanged elements hidden)
        }
    }

  # kubernetes_manifest.certificate_cinema must be replaced
-/+ resource "kubernetes_manifest" "certificate_cinema" {
!       manifest = {
!           metadata   = {
                name      = "cinema-cert"
!               namespace = "cinema" -> "istio-system" # forces replacement
            }
            # (3 unchanged elements hidden)
        }
!       object   = {
!           metadata   = {
!               annotations                = null -> (known after apply)
!               clusterName                = null -> (known after apply)
!               creationTimestamp          = null -> (known after apply)
!               deletionGracePeriodSeconds = null -> (known after apply)
!               deletionTimestamp          = null -> (known after apply)
!               finalizers                 = null -> (known after apply)
!               generateName               = null -> (known after apply)
!               generation                 = null -> (known after apply)
!               labels                     = null -> (known after apply)
!               managedFields              = null -> (known after apply)
                name                       = "cinema-cert"
!               namespace                  = "cinema" -> "istio-system"
!               ownerReferences            = null -> (known after apply)
!               resourceVersion            = null -> (known after apply)
!               selfLink                   = null -> (known after apply)
!               uid                        = null -> (known after apply)
            }
!           spec       = {
!               additionalOutputFormats = null -> (known after apply)
!               duration                = null -> (known after apply)
!               emailAddresses          = null -> (known after apply)
!               encodeUsagesInRequest   = null -> (known after apply)
!               ipAddresses             = null -> (known after apply)
!               isCA                    = null -> (known after apply)
!               issuerRef               = {
!                   group = null -> (known after apply)
                    name  = "zerossl"
                    # (1 unchanged element hidden)
                }
!               keystores               = {
!                   jks    = {
!                       create            = null -> (known after apply)
!                       passwordSecretRef = {
!                           key  = null -> (known after apply)
!                           name = null -> (known after apply)
                        }
                    }
!                   pkcs12 = {
!                       create            = null -> (known after apply)
!                       passwordSecretRef = {
!                           key  = null -> (known after apply)
!                           name = null -> (known after apply)
                        }
                    }
                }
!               literalSubject          = null -> (known after apply)
!               privateKey              = {
!                   algorithm      = null -> (known after apply)
!                   encoding       = null -> (known after apply)
!                   rotationPolicy = null -> (known after apply)
!                   size           = null -> (known after apply)
                }
!               renewBefore             = null -> (known after apply)
!               revisionHistoryLimit    = null -> (known after apply)
!               secretTemplate          = {
!                   annotations = null -> (known after apply)
!                   labels      = null -> (known after apply)
                }
!               subject                 = {
!                   countries           = null -> (known after apply)
!                   localities          = null -> (known after apply)
!                   organizationalUnits = null -> (known after apply)
!                   organizations       = null -> (known after apply)
!                   postalCodes         = null -> (known after apply)
!                   provinces           = null -> (known after apply)
!                   serialNumber        = null -> (known after apply)
!                   streetAddresses     = null -> (known after apply)
                }
!               uris                    = null -> (known after apply)
!               usages                  = null -> (known after apply)
                # (3 unchanged elements hidden)
            }
            # (2 unchanged elements hidden)
        }
    }

  # kubernetes_manifest.cinema-gateway will be created
+   resource "kubernetes_manifest" "cinema-gateway" {
+       manifest = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "Gateway"
+           metadata   = {
+               name      = "cinema"
+               namespace = "cinema"
            }
+           spec       = {
+               selector = {
+                   istio = "ingressgateway"
                }
+               servers  = [
+                   {
+                       hosts = [
+                           "wayofthesys.org",
                        ]
+                       port  = {
+                           name     = "http"
+                           number   = 80
+                           protocol = "HTTP"
                        }
+                       tls   = {
+                           httpsRedirect = false
                        }
                    },
+                   {
+                       hosts = [
+                           "wayofthesys.org",
                        ]
+                       port  = {
+                           name     = "https"
+                           number   = 443
+                           protocol = "HTTPS"
                        }
+                       tls   = {
+                           credentialName    = "wayofthesys-org-tls"
+                           mode              = "SIMPLE"
+                           privateKey        = "/etc/istio/ingressgateway-certs/tls.key"
+                           serverCertificate = "/etc/istio/ingressgateway-certs/tls.crt"
                        }
                    },
                ]
            }
        }
+       object   = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "Gateway"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "cinema"
+               namespace                  = "cinema"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               selector = {
+                   "istio" = "ingressgateway"
                }
+               servers  = [
+                   {
+                       bind            = (known after apply)
+                       defaultEndpoint = (known after apply)
+                       hosts           = [
+                           "wayofthesys.org",
                        ]
+                       name            = (known after apply)
+                       port            = {
+                           name       = "http"
+                           number     = 80
+                           protocol   = "HTTP"
+                           targetPort = (known after apply)
                        }
+                       tls             = {
+                           caCertificates        = (known after apply)
+                           cipherSuites          = (known after apply)
+                           credentialName        = (known after apply)
+                           httpsRedirect         = false
+                           maxProtocolVersion    = (known after apply)
+                           minProtocolVersion    = (known after apply)
+                           mode                  = (known after apply)
+                           privateKey            = (known after apply)
+                           serverCertificate     = (known after apply)
+                           subjectAltNames       = (known after apply)
+                           verifyCertificateHash = (known after apply)
+                           verifyCertificateSpki = (known after apply)
                        }
                    },
+                   {
+                       bind            = (known after apply)
+                       defaultEndpoint = (known after apply)
+                       hosts           = [
+                           "wayofthesys.org",
                        ]
+                       name            = (known after apply)
+                       port            = {
+                           name       = "https"
+                           number     = 443
+                           protocol   = "HTTPS"
+                           targetPort = (known after apply)
                        }
+                       tls             = {
+                           caCertificates        = (known after apply)
+                           cipherSuites          = (known after apply)
+                           credentialName        = "wayofthesys-org-tls"
+                           httpsRedirect         = (known after apply)
+                           maxProtocolVersion    = (known after apply)
+                           minProtocolVersion    = (known after apply)
+                           mode                  = "SIMPLE"
+                           privateKey            = "/etc/istio/ingressgateway-certs/tls.key"
+                           serverCertificate     = "/etc/istio/ingressgateway-certs/tls.crt"
+                           subjectAltNames       = (known after apply)
+                           verifyCertificateHash = (known after apply)
+                           verifyCertificateSpki = (known after apply)
                        }
                    },
                ]
            }
        }
    }

Plan: 4 to add, 0 to change, 2 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
